In [119]:
import pandas as pd

In [120]:
print(pd.__version__)

2.3.1

In [121]:
p = pd.Series([11,22,33,44,55])
print(p)

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [123]:
arr = [11,22,33,44,55]
# NOW if you want to start the index from 1 instead of 0
p = pd.Series(arr, index=range(1,len(arr)+1))
print(p)

1    11
2    22
3    33
4    44
5    55
dtype: int64

Creating series from dict data type

NOTE: in dict the key becomes the index for series

In [124]:
d = {1:11, 2:22, 3:33, 4:44}
p = pd.Series(d)
print(p)

1    11
2    22
3    33
4    44
dtype: int64

In [126]:
d = {1:11, 2:"22", 3:[33,44,55], 4:{44:12, 55:13}}
p = pd.Series(d)
print(p)

1                  11
2                  22
3        [33, 44, 55]
4    {44: 12, 55: 13}
dtype: object

accessing index values

In [ ]:
print(p[3])
print(p[3][2])
print(p[[1,2,3]]) # access multiple values

[33, 44, 55]
55
1              11
2              22
3    [33, 44, 55]
dtype: object

In [135]:
p = pd.Series([11,22,33,44,55])
print(p>50)
print(p[p>50])

0    False
1    False
2    False
3    False
4     True
dtype: bool
4    55
dtype: int64

In [136]:
print(p-p)

0    0
1    0
2    0
3    0
4    0
dtype: int64

### rank

By default, least value get rank 1, so on ...

In [141]:
p = pd.Series([22,1,33,0,44,55])
p.rank()

0    3.0
1    2.0
2    4.0
3    1.0
4    5.0
5    6.0
dtype: float64

if there are same elements, the rank gets computed using the

In [142]:
p = pd.Series([22,22,1,22,22,5])
p.rank()

0    4.5
1    4.5
2    1.0
3    4.5
4    4.5
5    2.0
dtype: float64

Mathematical Example<br>
If you have scores: [80, 90, 90, 100]<br>
Assign Raw Positions:
- 80 is at position
- 1.The two 90s are at positions 2 and 3
- 100 is at position 4.
  
Compute Rank (using average):
- The 90s occupy spots 2 and 3.
- $\text{Average Rank} = \frac{2 + 3}{2} = 2.5
- $Final Ranks: [1.0, 2.5, 2.5, 4.0]

<!-- Rank parameters:

- method: [‘average’, ‘min’, ‘max’, ‘first’, ‘dense’]
- ascending: bool -->

In [144]:
# sort values
p.sort_values(ascending=True)

# Checks for empty values
print(p.isnull())

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

Read .csv file

Head, Tail

In [154]:
df = pd.read_csv("./notebook/data.csv")

# head
print(df.head()) # gives only first 5 records
print(df.head(10)) # gives only first 10 records

# tail
print(df.tail()) # gives only last 5 records

   Day    Store  Percentage
0    1  Store A        45.2
1    2  Store B        52.1
2    3  Store A        48.5
3    4  Store C        61.3
4    5  Store B        55.8
   Day    Store  Percentage
0    1  Store A        45.2
1    2  Store B        52.1
2    3  Store A        48.5
3    4  Store C        61.3
4    5  Store B        55.8
5    6  Store A        49.2
6    7  Store C        59.7
7    8  Store B        53.4
8    9  Store A        46.1
9   10  Store C        62.5
    Day    Store  Percentage
25   26  Store B        57.1
26   27  Store A        50.6
27   28  Store C        62.4
28   29  Store B        53.8
29   30  Store A        51.2

Iloc - slicing and viewing data frame

In [156]:
df.iloc[20:25]

    Day    Store  Percentage
20   21  Store A        48.9
21   22  Store C        61.8
22   23  Store B        54.2
23   24  Store A        49.7
24   25  Store C        59.3

In [159]:
# Extraction of column
print(df[["Day"]].head())
print(df.columns)

   Day
0    1
1    2
2    3
3    4
4    5
Index(['Day', 'Store', 'Percentage'], dtype='object')

---

How many students are there in the dataset? What are the column names in the dataset? What is the average marks of all students? Who scored the highest marks?

Display only students from CSE department.

Add a new column "Result"

Marks ≥ 85 "Pass"

Else → "Needs Improvement"

Sort dataset in descending order of Marks Find minimum marks and display student name Count how many students in each department Display only Name and Marks columns

In [160]:
# 1. Load the dataset
df = pd.read_csv("./notebook/students.csv")
df.head()

     Name Dept  Marks
0  Ananya  CSE     85
1   Rahul  ECE     90
2   Meena  CSE     78

In [161]:
# Column names:
print("Column names: ", df.columns)

Column names:  Index(['Name', 'Dept', 'Marks'], dtype='object')

In [ ]:
# avg mark of all student:
avgMarks = df['Marks'].mean()
print(avgMarks)

84.33333333333333

In [165]:
# highest marks
print(df.loc[df['Marks'].idxmax()])

Name     Rahul
Dept       ECE
Marks       90
Name: 1, dtype: object

In [166]:
# filter CSE student only
print(df.loc[df['Dept']=="CSE"])

     Name Dept  Marks
0  Ananya  CSE     85
2   Meena  CSE     78

In [168]:
# add new column called result
df["Result"] = df["Marks"].apply(lambda x: "PASS" if x >=85 else "Needs Improvement")

df.head()

     Name Dept  Marks             Result
0  Ananya  CSE     85               PASS
1   Rahul  ECE     90               PASS
2   Meena  CSE     78  Needs Improvement

In [175]:
# Sort dataset in descending order of Marks Find minimum marks and display student name

# Sort in descending order
df.sort_values("Marks",ascending=False, inplace=True)
df.head()

# Get min mark
df.tail(1) # if you did inplace sort
df['Name'][df['Marks'].idxmin()]

'Meena'

In [ ]:
#  Count how many students in each department
df['Dept'].value_counts()
# df.groupby("Dept").count()

      Name  Marks  Result
Dept
CSE      2      2       2
ECE      1      1       1

In [183]:
# Display only Name and Marks columns
df[["Name", "Marks"]]

     Name  Marks
1   Rahul     90
0  Ananya     85
2   Meena     78